package hw2;

/*
Написать программу, которая бы вывела в консоль звездочки следующим образом:
*****
*****
*****
*****

 */

public class HW2_3 {
    public static void main(String[] args) {
        for (int i = 0; i < 4; i++) {
            System.out.println("*****");
        }
    }
}
